    ##### Геометрическая модель
**Расчетная область**

Симметричное обтекание

    """

    c1, c2 = st.columns([3,1])
    c1.image("11.png")

    r"""
    
    + $h - $ полувысота пластины
    + $(l_1, l_2) - $ положение пластины   
    + $(l_2 - l_1) - $ ширина пластины   
    + $\Omega - $ расчетная область  
    + $H, L - $ полуширина канала, расчетная длина канала
    + $\Gamma_1 - $ линии симметрии и граница пластины
    + $\Gamma_2 - $ твердые стенки канала   
    + $\Gamma_3, \Gamma_4 - $ граница входа и выхода жидкости

    """
