import streamlit as st
import base64
import pandas as pd

menu = st.sidebar.radio(
    '***',
    (
        "Аппроксимация полиномами степени $p = 1,2,3$",
        "Сравнение результатов",
        "Циркулляция",
        "Полувысота",
    )
)

def load_gif(gif_path):
    try:
        with open(gif_path, "rb") as file_:
            contents = file_.read()
            data_url = base64.b64encode(contents).decode("utf-8")
            return st.markdown(
                f'<img src="data:image/gif;base64,{data_url}" width="100%">',
                unsafe_allow_html=True,
            )
    except FileNotFoundError:
        st.error(f"Файл {gif_path} не найден!")
    except Exception as e:
        st.error(f"Ошибка загрузки GIF: {str(e)}")

if menu == "Аппроксимация полиномами степени $p=1,2,3$":
    r"""
    ##### Численное решение задачи вихре-потенциального симметричного обтекания пластины в канале при аппроксимации полиномами степени $p = 1,2,3$ 
    """
    
    mesh_size = st.selectbox(
        "Размер сетки",  
        ["4393", "15283", "66427"]  
    )
    
    poly_degree = st.selectbox(
        "Степень полинома",  
        ["p = 1", "p = 2", "p = 3"]  
    )

    if mesh_size == "4393":
        if poly_degree == "p = 1":
            load_gif("/home/anastasia/Документы/rep/4393_p1.gif")
            r"""
            -----------------------------------------------
            * Число ячеек сетки: 4393
            * Число узлов сетки: 2333
            * Число искомых дискретных значений: 2333
            * Макс. завихренность: 3.734975
            * Мин. завихренность: -18.026918
            * Число итераций: 12
            * $\Gamma = -1$
            * $\omega_0 = -2.0$
            ------------------------------------------------
            """
            
        elif poly_degree == "p = 2":
            load_gif("/home/anastasia/Документы/rep/4393_p2.gif")
            r"""
            -----------------------------------------------
            * Число ячеек сетки: 4393
            * Число узлов сетки: 2333
            * Число искомых дискретных значений: 9058
            * Макс. завихренность: 5.860120
            * Мин. завихренность: -21.511346
            * Число итераций: 19
            * $\Gamma = -1$
            * $\omega_0 = -2.0$
            ------------------------------------------------
            """
            
        elif poly_degree == "p = 3":
            load_gif("/home/anastasia/Документы/rep/4393_p3.gif")
            r"""
            -----------------------------------------------
            * Число ячеек сетки: 4393
            * Число узлов сетки: 2333
            * Число искомых дискретных значений: 20176
            * Макс. завихренность: 5.962610
            * Мин. завихренность: -21.255899
            * Число итераций: 15
            * $\Gamma = -1$
            * $\omega_0 = -2.0$
            ------------------------------------------------
            """
    if mesh_size == "15283":
        if poly_degree == "p = 1":
            load_gif("/home/anastasia/Документы/rep/15283_p1.gif")
            r"""
            -----------------------------------------------
            * Число ячеек сетки: 15283
            * Число узлов сетки: 7999
            * Число искомых дискретных значений: 7999
            * Макс. завихренность: 3.905896
            * Мин. завихренность: -17.746363
            * Число итераций: 14
            * $\Gamma = -1$
            * $\omega_0 = -2.0$
            ------------------------------------------------
            """
            
        elif poly_degree == "p = 2":
            load_gif("/home/anastasia/Документы/rep/15283_p2.gif")
            r"""
            -----------------------------------------------
            * Число ячеек сетки: 15283
            * Число узлов сетки: 7999
            * Число искомых дискретных значений: 31280
            * Макс. завихренность: 7.211165
            * Мин. завихренность: -21.394293
            * Число итераций: 11
            * $\Gamma = -1$
            * $\omega_0 = -2.0$
            ------------------------------------------------
            """
            
        elif poly_degree == "p = 3":
            load_gif("/home/anastasia/Документы/rep/15283_p3.gif")
            r"""
            -----------------------------------------------
            * Число ячеек сетки: 15283
            * Число узлов сетки: 7999
            * Число искомых дискретных значений: 698442
            * Макс. завихренность: 6.332100
            * Мин. завихренность: -20.520577
            * Число итераций: 13
            * $\Gamma = -1$
            * $\omega_0 = -2.0$
            ------------------------------------------------
            """
            
    if mesh_size == "66427":
        if poly_degree == "p = 1":
            load_gif("/home/anastasia/Документы/rep/66427_p1.gif")
            r"""
            -----------------------------------------------
            * Число ячеек сетки: 66427
            * Число узлов сетки: 34492
            * Число искомых дискретных значений: 34492
            * Макс. завихренность: 4.459126
            * Мин. завихренность: -18.050687
            * Число итераций: 10
            * $\Gamma = -1$
            * $\omega_0 = -2.0$
            ------------------------------------------------
            """
            
        elif poly_degree == "p = 2":
            load_gif("/home/anastasia/Документы/rep/66427_p2.gif")
            r"""
            -----------------------------------------------
            * Число ячеек сетки: 66427
            * Число узлов сетки: 34492
            * Число искомых дискретных значений: 135410
            * Макс. завихренность: 6.869948
            * Мин. завихренность: -21.333706
            * Число итераций: 12
            * $\Gamma = -1$
            * $\omega_0 = -2.0$
            ------------------------------------------------
            """
            
        elif poly_degree == "p = 3":
            load_gif("/home/anastasia/Документы/rep/66427_p3.gif")
            r"""
            -----------------------------------------------
            * Число ячеек сетки: 66427
            * Число узлов сетки: 34492
            * Число искомых дискретных значений: 302755
            * Макс. завихренность: 6.306304
            * Мин. завихренность: -20.528418
            * Число итераций: 19
            * $\Gamma = -1$
            * $\omega_0 = -2.0$
            ------------------------------------------------
            """
if menu == "Сравнение результатов":
    r"""
    ##### Число искомых дискретных значений в зависимости от размера сетки и порядка аппроксимации  $p$
    """
    data = {
        "Размер сетки": [4393, 15283, 66427],
        "Ст. свободы": [2333, 7999, 34492],
        "Макс. завихр.": [3.73, 3.91, 4.46],
        "Мин. завихр.": [-18.03, -17.75, -18.05]
    }

    df_p1 = pd.DataFrame({
        "Размер сетки": data["Размер сетки"],
        "Степени свободы": data["Ст. свободы"],
        "Макс. завихренность": data["Макс. завихр."],
        "Мин. завихренность": data["Мин. завихр."]
    })
    
    data = {    
        "Размер сетки": [4393, 15283, 66427],
        "Ст. свободы": [9058, 31280, 135410],
        "Макс. завихр.": [5.86, 7.21, 6.87],
        "Мин. завихр.": [-21.51, -21.39, -21.33]
    }

    df_p2 = pd.DataFrame({
        "Размер сетки": data["Размер сетки"],
        "Степени свободы": data["Ст. свободы"],
        "Макс. завихренность": data["Макс. завихр."],
        "Мин. завихренность": data["Мин. завихр."]
    })
    
    data = { 
        "Размер сетки": [4393, 15283, 66427],
        "Ст. свободы": [20176, 698442, 302755],
        "Макс. завихр.": [5.96, 6.33, 6.31],
        "Мин. завихр.": [-21.26, -20.52, -20.53]
    }

    df_p3 = pd.DataFrame({
        "Размер сетки": data["Размер сетки"],
        "Степени свободы": data["Ст. свободы"],
        "Макс. завихренность": data["Макс. завихр."],
        "Мин. завихренность": data["Мин. завихр."]
    })


    r"""Порядок аппроксимации $p = 1$"""
    st.dataframe(
        df_p1,
        hide_index=True,
        use_container_width=True,
        column_config={
            "Размер сетки": st.column_config.NumberColumn(width="small"),
            "Степени свободы": st.column_config.NumberColumn(width="medium"),
            "Макс. завихренность": st.column_config.NumberColumn(format="%.2f"),
            "Мин. завихренность": st.column_config.NumberColumn(format="%.2f")
        }
    )

    r"""Порядок аппроксимации $p = 2$"""
    st.dataframe(
        df_p2,
        hide_index=True,
        use_container_width=True,
        column_config={
            "Размер сетки": st.column_config.NumberColumn(width="small"),
            "Степени свободы": st.column_config.NumberColumn(width="medium"),
            "Макс. завихренность": st.column_config.NumberColumn(format="%.2f"),
            "Мин. завихренность": st.column_config.NumberColumn(format="%.2f")
        }
    )

    r"""Порядок аппроксимации $p = 3$"""
    st.dataframe(
        df_p3,
        hide_index=True,
        use_container_width=True,
        column_config={
            "Размер сетки": st.column_config.NumberColumn(width="small"),
            "Степени свободы": st.column_config.NumberColumn(width="medium"),
            "Макс. завихренность": st.column_config.NumberColumn(format="%.2f"),
            "Мин. завихренность": st.column_config.NumberColumn(format="%.2f")
        }
    )
            
if menu == "Циркулляция":
    r"""
    ##### Численное решение задачи вихре-потенциального симметричного обтекания пластины в канале при различной циркуляции $\Gamma$ 
    """
    gamma = st.selectbox(
        "Значение циркуляции",  
        ["-0.5", "-1", "-2"]  
    )
    
    if gamma == "-0.5":
        load_gif("/home/anastasia/Документы/rep/gamma2_05.gif")
        r"""
            -----------------------------------------------
            * Число ячеек сетки: 15283
            * Число узлов сетки: 7999
            * Число искомых дискретных значений: 7999
            * Макс. завихренность: 5.152000
            * Мин. завихренность: -21.807968
            * Число итераций: 11
            * $\omega_0 =$ -2
            * p = 1
            ------------------------------------------------
        """
    if gamma == "-1":
        load_gif("/home/anastasia/Документы/rep/gamma2_1.gif")
        r"""
            -----------------------------------------------
            * Число ячеек сетки: 15283
            * Число узлов сетки: 7999
            * Число искомых дискретных значений: 7999
            * Макс. завихренность: 4.459126
            * Мин. завихренность: -18.050687
            * Число итераций: 10
            * $\omega_0 =$ -2
            * p = 1
            ------------------------------------------------
        """
    if gamma == "-2":
        load_gif("/home/anastasia/Документы/rep/gamma2_2.gif")
        r"""
            -----------------------------------------------
            * Число ячеек сетки: 15283
            * Число узлов сетки: 7999
            * Число искомых дискретных значений: 7999
            * Макс. завихренность: 3.871740
            * Мин. завихренность: -16.011488
            * Число итераций: 13
            * $\omega_0 =$ -2
            * p = 1
            ------------------------------------------------
        """
        
if menu == "Полувысота":
    r"""
    ##### Численное решение задачи вихре-потенциального симметричного обтекания пластины в канале при изменении полувысоты пластины $h$
    """
    
    height = st.selectbox(
        "Полувысота пластины",  
        ["0.25", "0.5", "0.75"]  
    )
    
    if height == "0.25":
        load_gif("/home/anastasia/Документы/rep/height2_025.gif")
        r"""
            -----------------------------------------------
            * Число ячеек сетки: 15283
            * Число узлов сетки: 7999
            * Число искомых дискретных значений: 7999
            * Макс. завихренность: 3.922733
            * Мин. завихренность: -21.159928
            * Число итераций: 17
            * $\Gamma =$ -1
            * $\omega_0 =$ -2
            * p = 1
            ------------------------------------------------
        """
    if height == "0.5":
        load_gif("/home/anastasia/Документы/rep/height2_05.gif")
        r"""
            -----------------------------------------------
            * Число ячеек сетки: 15283
            * Число узлов сетки: 7999
            * Число искомых дискретных значений: 7999
            * Макс. завихренность: 4.079369
            * Мин. завихренность: -20.610520
            * Итераций: 70
            * $\Gamma =$ -1
            * $\omega_0 =$ -2
            * p = 1
            ------------------------------------------------
        """
    if height == "0.75":
        load_gif("/home/anastasia/Документы/rep/height2_075.gif")
        r"""
            -----------------------------------------------
            * Число ячеек сетки: 15283
            * Число узлов сетки: 7999
            * Число искомых дискретных значений: 7999
            * Макс. завихренность: 2.322699
            * Мин. завихренность: -11.729287
            * Итераций: 86
            * $\Gamma =$ -1
            * $\omega_0 =$ -2
            * p = 1
            ------------------------------------------------
        """
    

           
    
        


        
    
    
        


    


            
 
            
            
            
            
            
            
            
